---
kind: type
id: T:Autodesk.Revit.DB.SweptBlend
source: html/8e50efa3-fc77-64f1-7c14-4e2089699921.htm
---
# Autodesk.Revit.DB.SweptBlend

A swept blend solid or void form.

## Syntax (C#)
```csharp
public class SweptBlend : GenericForm
```